print('Лабораторна робота №1 \nВаріант №5 \nЛутак М. В. \nКМ-92 \nЗнаходження розташування точки на площині ХОY')
while True:
    try:
        print('На площині задано точку А(x;y). Введіть значення x:')
        x = float(input())
        print('Введіть значення y:')
        y = float(input())
        if x>0 and y>0:
            print('Точка розташована у першій координатній чверті')
        if x>0 and y<0:
            print('Точка розташована у четвертій координатній чверті')
        if x<0 and y>0:
            print('Точка розташована у другій координатній чверті')
        if x<0 and y<0:
            print('Точка розташована у третій координатній чверті')
        if x==0 and y!=0:
            print('Точка розташована на осі OY')
        if x!=0 and y==0:
            print('Точка розташована на осі OX')
        if x==0 and y==0:
            print('Точка розташована у початку координат')
    except:
        print('Введено некоректні дані')