print('Лабораторна робота №1 \nВаріант №5 \nЛутак М.В. \nКМ-92 \nЗнаходження вартості покупки в магазині')
while True:
    try:
        print('Введіть ціну за 1 кг цукерок')
        x = float(input())
        print('Введіть ціну за 1 кг печива')
        y = float(input())
        print('Вартість однієї покупки з 300 г цукерок і 400 г печива')
        V = 0.3*x + 0.4*y
        print(V)
        print('Вартість трьох покупок, кожна з 2 кг печива і 1 кг 800 г цукерок')
        S = 3*(2*x + 1.8*y)
        print(S)
    except:
        print('Ціну вказано невірно')